openenergymonitor/STM32/Software/Sombrero_VE_Working5/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2020 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"
#include "adc.h"
#include "dma.h"
#include "i2c.h"
#include "opamp.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include <time.h>
#include <math.h>
#include <string.h>
#include <stdbool.h>
#include "jsmn.h"
#include "RFM69.h"
#include "RFM69_ext.h"
//#include "ds18b20.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

//--------
// MODES
//--------
// 0 = Standalone
// 1 = rPi
// 2 = ESP32
int mode = 1; // initialised as rPi mode for testing.


//------------------------------------------------
// timing, ADCs, power and frequency variables
//------------------------------------------------
#define MID_ADC_READING 2048
uint32_t posting_interval = 2500; // millis to post data at.
bool readings_ready = false;
bool readings_requested = false;
bool first_readings = false;
double V_RATIO;
double I_RATIO;
//uint16_t const adc_buff_half_size;
const double adc_conversion_time = (194.0*(1.0/(72000000.0/4))); // time in seconds for an ADC conversion, for estimating mains AC frequency.
//const double adc_conversion_time = (614.0*(1.0/(72000000.0/4))); // time in seconds for an ADC conversion, for estimating mains AC frequency.
//const double phase_resolution = (adc_conversion_time / (1.0/50.0)) * 360.0);
double mains_frequency;
static double Ws_accumulator[CTn] = {0};
//bool Vclipped; // unlikely?
//bool hunt_PF;


//------------------------
// Channel Accumulators
//------------------------
typedef struct channel_
{
  int64_t sum_P;
  uint64_t sum_V_sq;
  uint64_t sum_I_sq;
  int64_t sum_V;
  int64_t sum_I;
  uint32_t count;
  uint32_t cycles;
  uint32_t phase_shift;
  uint32_t positive_V;
  uint32_t last_positive_V;
  uint32_t Iclipped;
} channel_t; // data struct per CT channel, stm32 only does 32-bit struct items, anything else gets padded out to 32-bit automatically by

static channel_t channels[CTn] = {0};
static channel_t channels_ready[CTn] = {0};
bool channel_rdy_bools[CTn] = {0};


//----------------
// CALIBRATION
//----------------
const double VOLTS_PER_DIV = (3.3 / 4096.0);
double VCAL = 268.97*0.9940357853; // default ideal power UK, adjusted
//double VCAL = 271.748953974895; // calc'd by DB, 20.5.2020

//double VCAL = 266.1238757156; // note - single-phase proto board
//double VCAL = 224.4135906687; // note - 3-phase proto board
//double VCAL = 236.660160908; // mascot ac-ac adaptor
double ICAL = (100/0.05)/22.0; // f(rated input, rated output, burden value)



//----------------
// PHASE CALIBRATION
//----------------
// Finite Impulse Response (FIR) filter-like Power Factor correction.
// based on setting the voltage phase per individual CT channel.
int hunt_PF[CTn] = {0}; // which channel are we hunting max power factor on?
// 0 = no power factor hunting.
// 1 = power factor hunt start.
// 2 = power factor hunt to the right. (increase VT lead).
// 3 = power factor hunt to the left. (increase VT lag).
// 4 = hunt finishing.
// 5 = hunt complete.
static int16_t phase_corrections[CTn] = {0};   // store of phase corrections per channel.
uint8_t phHunt_direction_changes = 0; // we're aiming for phase_correction_iteration_target.
static const int phHunt_direction_change_target = 5; // how many times will the phase hunt change direction?
double last_powerFactor[CTn]; // PF from previous readings.
double powerFactor_now[CTn];  // PF from most recent readings.
//bool pfhuntDone[CTn] = {0};


//------------------------
// UART SERIAL BUFFERS
//------------------------
extern char log_buffer[];
char rx_string[COMMAND_BUFFER_SIZE];
char string_buffer[200];
char readings_rdy_buffer[1000];


//----------------
// RADIO
//----------------
bool radio_send = 0; // set to 1 to send test data with RFM69.
static uint16_t networkID = 210; // a.k.a. Network Group
static uint8_t nodeID = 10; // this node's ID (address).
static uint16_t freqBand = 433; // MHz
static uint8_t toAddress = 1; // destination address.
bool requestACK = false; // untested.
static char encryptkey[20] = {'\0'}; // twenty character encrypt key, or  '\0'  for nothing.
//char encryptkey[20] = "asdfasdfasdfasdf"; // twenty character encrypt key, or  '\0'  for nothing.
typedef struct {
  uint32_t nodeId; 
  uint32_t uptime;
  //double temperature;   // other data
} Payload;
Payload radioData;


//----------------
// Time variables
//----------------
uint32_t current_millis;
uint32_t previous_millis;


//----------------
// MISC
//----------------
static uint32_t pulseCount = 0;
extern char json_response[40];


/* USER CODE END PV */

