openenergymonitor/STM32/Software/Sombrero_VE_Working5/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */



//------------------------
// EEPROM Emulation
//------------------------
// Credit to Viktor Vano for the Flash read/write code
// https://github.com/viktorvano/STM32F3Discovery_internal_FLASH  

#define FLASH_STORAGE 0x08030000 // Maximum value for STM32F303xE is defined at line 111 of stm32f3xx_hal_flash_ex.h (0x0807FFFFU)
#define page_size 0x800

void save_to_flash(uint8_t *data)
{
	volatile uint32_t data_to_FLASH[(strlen((char*)data)/4)	+ (int)((strlen((char*)data) % 4) != 0)];
	memset((uint8_t*)data_to_FLASH, 0, strlen((char*)data_to_FLASH));
	strcpy((char*)data_to_FLASH, (char*)data);

	volatile uint32_t data_length = (strlen((char*)data_to_FLASH) / 4)
									+ (int)((strlen((char*)data_to_FLASH) % 4) != 0);
	volatile uint16_t pages = (strlen((char*)data)/page_size)
									+ (int)((strlen((char*)data)%page_size) != 0);
	  /* Unlock the Flash to enable the flash control register access *************/
	  HAL_FLASH_Unlock();

	  /* Allow Access to option bytes sector */
	  HAL_FLASH_OB_Unlock();

	  /* Fill EraseInit structure*/
	  FLASH_EraseInitTypeDef EraseInitStruct;
	  EraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
	  EraseInitStruct.PageAddress = FLASH_STORAGE;
	  EraseInitStruct.NbPages = pages;
	  uint32_t PageError;

	  volatile uint32_t write_cnt=0, index=0;

	  volatile HAL_StatusTypeDef status;
	  status = HAL_FLASHEx_Erase(&EraseInitStruct, &PageError);
	  while(index < data_length)
	  {
		  if (status == HAL_OK)
		  {
			  status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, FLASH_STORAGE+write_cnt, data_to_FLASH[index]);
			  if(status == HAL_OK)
			  {
				  write_cnt += 4;
				  index++;
			  }
		  }
	  }

	  HAL_FLASH_OB_Lock();
	  HAL_FLASH_Lock();
}

void read_flash(uint8_t* data)
{
	volatile uint32_t read_data;
	volatile uint32_t read_cnt=0;
	do
	{
		read_data = *(uint32_t*)(FLASH_STORAGE + read_cnt);
		if(read_data != 0xFFFFFFFF)
		{
			data[read_cnt] = (uint8_t)read_data;
			data[read_cnt + 1] = (uint8_t)(read_data >> 8);
			data[read_cnt + 2] = (uint8_t)(read_data >> 16);
			data[read_cnt + 3] = (uint8_t)(read_data >> 24);
			read_cnt += 4;
		}
	}while(read_data != 0xFFFFFFFF);
}



//------------------------------------------
// Calculate Power Data for one Channel
//------------------------------------------
double Vrms;
double Irms;
double realPower;
double apparentPower;
double powerFactor;

void calcPower (int ch)
{
  channel_t *chn = &channels_ready[ch];

  double Vmean = (double)chn->sum_V / (double)chn->count;
  double Imean = (double)chn->sum_I / (double)chn->count;

  double f32sum_V_sq_avg = (double)chn->sum_V_sq / (double)chn->count;
  f32sum_V_sq_avg -= (Vmean * Vmean); // offset removal

  double f32sum_I_sq_avg = (double)chn->sum_I_sq / (double)chn->count;
  f32sum_I_sq_avg -= (Imean * Imean); // offset removal

  // assuming result of offset removal always positive.
  // small chance a negative result would cause a nan at sqrt.

  Vrms = V_RATIO * sqrt(f32sum_V_sq_avg);
  Irms = I_RATIO * sqrt(f32sum_I_sq_avg);

  double f32_sum_P_avg = (double)chn->sum_P / (double)chn->count;
  double mean_P = f32_sum_P_avg - (Vmean * Imean); // offset removal
  
  realPower = V_RATIO * I_RATIO * mean_P;
  apparentPower = Vrms * Irms;

  // calculate PF, is it necessary to prevent dividing by zero error?
  if (apparentPower != 0) { powerFactor = realPower / apparentPower; }
  else powerFactor = 0;

  Ws_accumulator[ch] += (realPower * (posting_interval / 1000.0));
}


//------------------------------------------
// FIR-type filter for phase correction.
//------------------------------------------
uint16_t highest_phase_correction = 0;
void set_highest_phase_correction(void) { // could be done after each correction routine instead.
  highest_phase_correction = 0; // reset. 
  for (int i = 0; i < CTn; i++) {
    if (phase_corrections[i] > highest_phase_correction) highest_phase_correction = phase_corrections[i];
  }
}

bool check_dma_index_for_phase_correction(uint16_t offset) {
  // HAL_DELAY(1); // test
  uint16_t dma_counter_now = hdma_adc1.Instance->CNDTR;
  //sprintf(log_buffer, "dma_counter_now:%d, offset:%d, highest_correction:%d\r\n", dma_counter_now, offset, highest_phase_correction);
  //debug_printf(log_buffer); log_buffer[0] = 0;
  if (offset == 0) {
    if (adc_buff_half_size - dma_counter_now > highest_phase_correction) { return true; }
    else { return false; }
  }
  else if (offset == adc_buff_half_size) {
    if (adc_buff_size - dma_counter_now > highest_phase_correction) {return true; }
    else { return false; }
  }
  return false; // get rid of compiler warning.
}

int findmode(int a[],int n) { // https://www.tutorialspoint.com/learn_c_by_examples/mode_program_in_c.htm
   int maxValue = 0, maxCount = 0, i, j;
   for (i = 0; i < n; ++i) {
      int count = 0;
      for (j = 0; j < n; ++j) {
         if (a[j] == a[i])
         ++count;
      }
      if (count > maxCount) {
         maxCount = count;
         maxValue = a[i];
      }
   }
   if (maxCount < 3) debug_printf("No confident value found.\r\n");
   return maxValue;
}

int pf_median_array[5]; // stores the phase_corrections value at the point of switching direction.
int *pf_ptr = pf_median_array;
void pfHunt(int ch) {
  if (hunt_PF[ch] == 0) { 
    __NOP();
  }
  else if (hunt_PF[ch] == true) { // start hunting one direction
    phase_corrections[ch]++; hunt_PF[ch]++;
    // print phase correction.
    sprintf(log_buffer, "PFstart++ | Setting phase_corrections[%d] to %d\r\n", ch, phase_corrections[ch]);
    //debug_printf(log_buffer); log_buffer[0] = '\0';
  }
  else if (hunt_PF[ch] == 2) { // continue this direction unless...
    sprintf(log_buffer, "PF_now:%.6lf | last_PF:%.6lf | phase_corrections[%d] was at %d, equal to %.2lf degrees phase shift.\r\n", powerFactor_now[ch], last_powerFactor[ch], ch, phase_corrections[ch], (360.0*((adc_conversion_time*phase_corrections[ch])/(1/mains_frequency)))); debug_printf(log_buffer); log_buffer[0] = '\0';
    if (powerFactor_now[ch] > last_powerFactor[ch]) phase_corrections[ch]++; // keep going forwards into the buffer
    else { hunt_PF[ch]++; phHunt_direction_changes++; phase_corrections[ch]--; *pf_ptr = phase_corrections[ch]; pf_ptr++; } // switch direction and start going backwards into the buffer
    // print phase correction.
    sprintf(log_buffer, "PF++ | Setting phase_corrections[%d] to %d. Switched direction %d times.\r\n", ch, phase_corrections[ch], phHunt_direction_changes);
    //debug_printf(log_buffer); log_buffer[0] = '\0';
    if (phHunt_direction_changes == phHunt_direction_change_target) hunt_PF[ch] = 4;
  }
  else if (hunt_PF[ch] == 3) { // hunt the other direction until...
    sprintf(log_buffer, "PF_now:%.6lf | last_PF:%.6lf | phase_corrections[%d] was at %d, equal to %.2lf degrees phase shift.\r\n", powerFactor_now[ch], last_powerFactor[ch], ch, phase_corrections[ch], (360.0*((adc_conversion_time*phase_corrections[ch])/(1/mains_frequency)))); debug_printf(log_buffer); log_buffer[0] = '\0';    
    if (powerFactor_now[ch] > last_powerFactor[ch]) phase_corrections[ch]--; // keep going backwards into the buffer
    else { hunt_PF[ch]--; phHunt_direction_changes++; phase_corrections[ch]++; *pf_ptr = phase_corrections[ch]; pf_ptr++; } // switch direction and go forwards again into the buffer
    // print phase correction.
    sprintf(log_buffer, "PF-- | Setting phase_corrections[%d] to %d. Switched direction %d times.\r\n", ch, phase_corrections[ch], phHunt_direction_changes);
    //debug_printf(log_buffer); log_buffer[0] = '\0';
    if (phHunt_direction_changes == phHunt_direction_change_target) hunt_PF[ch] = 4;
  }
  else if (hunt_PF[ch] == 4) {
    // finish up...
    for (int i = 0; i < phHunt_direction_change_target; i++) { sprintf(log_buffer, "pf_median_array[%d] value was %d\r\n", i, pf_median_array[i]); debug_printf(log_buffer); }
    
    sprintf(log_buffer, "mode:%d\r\n", findmode(pf_median_array, phHunt_direction_change_target)); debug_printf(log_buffer); log_buffer[0] = '\0';
    
    phase_corrections[ch] = findmode(pf_median_array, phHunt_direction_change_target); // the result is set in phase_corrections[] for this channel now.
    
    sprintf(log_buffer, "Maximum PF found! phase_correction[%d] is at %d, equal to %.2lf degrees phase shift.\r\n", ch, phase_corrections[ch], (360.0*((adc_conversion_time*phase_corrections[ch])/(1/mains_frequency))));
    hunt_PF[ch] = 5;
  }
  set_highest_phase_correction(); // update the highest value.
}


//------------------------------------------
// Process Buffer into Accumulators.
//------------------------------------------
//bool hia = 0;
void process_frame (uint16_t offset)
{
  /* debugging
  if (!hia) {
    debug_printf("Hello! First process_frame!\r\n");
    hia =1;
  }
  */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_SET); // blink the led
  
  //set_highest_phase_correction(); // could be called after a phase correction routine instead.
  while (!check_dma_index_for_phase_correction(offset)) __NOP();

  int16_t sample_V, sample_I, signed_V, signed_I;
  
