openenergymonitor/STM32/Software/Sombrero_VE_Working5/Src/main.c
   // to hunt one adc_buffer_index per readings_ready, because it's only in readings_ready where PF is calc'd.
  /*
  sprintf(log_buffer, "adc_buff_half_size:%d\r\n", adc_buff_half_size);
  debug_printf(log_buffer);
  log_buffer[0] = '\0';
  */

  for (uint16_t i = 0; i < adc_buff_half_size; i += CTn) // CTn = CT channel quanity.
  {
    
    /* // debug buffer
    sprintf(log_buffer, "signed_v:%d\r\n", signed_V);
    debug_printf(log_buffer);
    log_buffer[0] = '\0';
    */

    //----------------------------------------
    // Power
    //----------------------------------------
    // Cycle through channels, accumulating
    for (int ch = 0; ch < CTn; ch++)
    {
      channel_t *channel = &channels[ch];
      //----------------------------------------
      // Voltage
      //----------------------------------------
      // phase correction could happen here to have higher resolution. 
      // to shift voltage gives finer grained phase resolution in single-phase mode
      // because the voltage channel is used by all CTs.
      int16_t sample_V_index = offset + i + ch + phase_corrections[ch];
      // check for buffer overflow
      if (sample_V_index >= adc_buff_size) sample_V_index -= adc_buff_size; 
      else if (sample_V_index < 0) sample_V_index += adc_buff_size; 
      
      sample_V = adc1_dma_buff[sample_V_index];
      //if (sample_V == 4095) Vclipped = true; // unlikely
      signed_V = sample_V - MID_ADC_READING;
      channel->sum_V += signed_V;
      channel->sum_V_sq += signed_V * signed_V; // for Vrms
      //----------------------------------------
      // Current
      //----------------------------------------
      sample_I = adc2_dma_buff[offset + i + ch];
      if (sample_I == 4095) channel->Iclipped = true; // much more likely, useful safety information.
      signed_I = sample_I - MID_ADC_READING; // mid-rail removal possible through ADC4, option for future perhaps.
      channel->sum_I += signed_I; // 
      channel->sum_I_sq += signed_I * signed_I; // for Irms
      //----------------------------------------
      // Power, instantaneous.
      //----------------------------------------
      channel->sum_P += signed_V * signed_I;
      
      channel->count++; // number of adc samples.
      
      //----------------------------------------
      // Upwards-zero-crossing detection, whole AC cycles.
      channel->last_positive_V = channel->positive_V; // retrieve the previous value.
      if (signed_V >= 0) { channel->positive_V = true; } // changed > to >= . not important as MID_ADC_READING 2048 not accurate anyway.
      else { channel->positive_V = false; }
      //--------------------------------------------------
      //--------------------------------------------------
      if (!channel->last_positive_V && channel->positive_V) { // looking out for a upwards-zero crossing.
        channel->cycles++; // rather than count cycles for readings_ready, better to have the main loop ask for them.
        // debug cycle count 
        /*
        sprintf(log_buffer, "cycles%d:%ld\r\n", ch, channel->cycles);
        debug_printf(log_buffer);
        log_buffer[0] = '\0';
        */
        //----------------------------------------
        if (readings_requested && !channel_rdy_bools[ch]) { // if readings are needed by the main loop and channel is not copied/ready.
          channel_t *channel_ready = &channels_ready[ch];
          // copy accumulators for use in main loop.
          memcpy((void*)channel_ready, (void*)channel, sizeof(channel_t));
          // reset accumulators to zero.
          memset((void*)channel, 0, sizeof(channel_t));
          // follow through the state of positive_v so no extra AC cycle is erroneously counted.
          channel->positive_V = true;
          // set 'channel ready' for this channel.
          channel_rdy_bools[ch] = true;
          // are all the channels ready?
          int chn_ready_count = 0;
          for (int j = 0; j < CTn; j++) {
            if (channel_rdy_bools[j]) chn_ready_count++;
          }
          if (chn_ready_count == CTn) { readings_ready = true; readings_requested = false; }
          
          // test waveform sync. printed result should go from 1 to 9.
          /*
          sprintf(log_buffer, "channelsRdy:%d\r\n", chn_ready_count);
          debug_printf(log_buffer);
          log_buffer[0] = '\0';
          */
        }
      }
      //-------------------------------------------------- 
      //-------------------------------------------------- end zero-crossing.
    } // end per channel routine
  } // end buffer routine
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_RESET);
} // end process_frame().




/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  V_RATIO = VCAL * VOLTS_PER_DIV;
  I_RATIO = ICAL * VOLTS_PER_DIV;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_OPAMP4_Init();
  MX_TIM8_Init();
  MX_ADC1_Init();
  MX_USART1_UART_Init();
  MX_TIM16_Init();
  MX_ADC2_Init();
  MX_SPI1_Init();
  MX_SPI4_Init();
  MX_UART4_Init();
  MX_USART3_UART_Init();
  MX_I2C3_Init();
  MX_UART5_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */
  
  HAL_Delay(10);

  //------------------------
  // UART DMA RX BEGIN
  //------------------------
  __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);
  HAL_UART_Receive_DMA(&huart1, rx_buff, sizeof(rx_buff));
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);
  HAL_UART_Receive_DMA(&huart2, rx_buff, sizeof(rx_buff));

  __HAL_UART_ENABLE_IT(&huart1, UART_IT_TC); // necessary only to know if we're good to fire another Tx soon after a HAL_UART_Transmit_IT()
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_TC);
  
  // usart1_rx_flag = 1; // debugging


  HAL_Delay(10);
  debug_printf("\r\n\r\nstart, connect VT\r\n");
  
  // RTC backup register test, 16 x 32-bit addresses available.
  // see stm32f3xx_hal_rtc_ex.c  line 1118 onwards.
  // uint32_t bkp_write = 123456789;
  // HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, bkp_write);
  // uint32_t bkp_ = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0);
  // sprintf(log_buffer, "bkp_:%ld\r\n", bkp_);
  // works!

  //------------------------
  // EEPROM Emulation test
  //------------------------
  /*
  char write_data_pgm[50];
  strcpy(write_data_pgm, "Hellow from Flash Memory!\r\n");
  save_to_flash((uint8_t*) write_data_pgm);
  char read_data_pgm[50];
  read_flash((uint8_t*)read_data_pgm);
  debug_printf(read_data_pgm); // print result
  
